[
  {
    "title": "On Immigration",
    "date": "2010-05-08",
    "author": "John Vandivier",
    "content": "The following is the text of my latest academic paper. It's on the topic of immigration with a special focus on illegal immigration as a social and political issue.\n\nImmigration is a long standing issue in the United States. Over time many beliefs have been formed, held, changed, and withdrawn on the subject. In this paper I will focus on immigration as a modern social and political issue, with specific interest towards the topic of illegal immigration. I will use academic resources and the opinions of political analysts, combine them with my own ideas, and form an independent assessment of the current political and social climate surrounding immigration. Of particular interest to this paper will be the discussion of federal immigration reform, the new Arizona state law dealing with immigration, the source of illegal immigration in general, whether immigration is good or bad in the long run for the US, and what we all can do as American citizens to best take care of our national interests in light of this information.\n\nLet's start by defining illegal immigration. Illegal immigration is defined as the movement of people across national borders in a way that violates the immigration laws of the destination country...",
    "status": "publish",
    "filename": "2010-05-08-on-immigration.md",
    "filepath": "content/2010-05-08-on-immigration.md",
    "chunk_id": 1
  },
  {
    "title": "Nintendo Heart",
    "date": "2012-09-24",
    "author": "John Vandivier",
    "content": "The video below was the first song I did in Cubase. Enjoy!<br /><br />[youtube http://www.youtube.com/watch?v=oh6a_ww3coQ&amp;w=420&amp;h=315]",
    "status": "publish",
    "filename": "2012-09-24-nintendo-heart.md",
    "filepath": "content/2012-09-24-nintendo-heart.md",
    "chunk_id": 1
  },
  {
    "title": "European Idea of Poverty is Wrong",
    "date": "2012-09-24",
    "author": "John Vandivier",
    "content": "Here's a video that tries to define poverty:<br /><br />[youtube http://www.youtube.com/watch?v=GL-8HPdBroc&amp;w=560&amp;h=315]<br /><br />As you can see the definition is shaky at best...",
    "status": "publish", 
    "filename": "2012-09-24-european-idea-of-poverty-is-wrong.md",
    "filepath": "content/2012-09-24-european-idea-of-poverty-is-wrong.md",
    "chunk_id": 1
  },
  {
    "title": "Unpacking the Vandivier-Coase Theorem",
    "date": "2015-12-04",
    "author": "John Vandivier",
    "content": "In this article I want to further explain the <a href=\"http://www.afterecon.com/economics-and-finance/vandivier-coase-theorem/\">Vandivier-Coase Theorem</a>...",
    "status": "inherit",
    "filename": "2015-12-04-unpacking-the-vandivier-coase-theorem.md",
    "filepath": "content/2015-12-04-unpacking-the-vandivier-coase-theorem.md",
    "chunk_id": 1
  }
] 